Revit 2026 API

# PartMakerMethodToDivideVolumesGetSketchCurves Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void GetSketchCurves(
	out IList<Curve> curveArray
)
```
```vb
Public Sub GetSketchCurves (
	<OutAttribute> ByRef curveArray As IList(Of Curve)
)
```
```cpp
public:
void GetSketchCurves(
	[OutAttribute] IList<Curve^>^% curveArray
)
```
```fsharp
member GetSketchCurves :
        curveArray : IList<Curve> byref -> unit
```

#### Parameters

curveArray IListCurve

#### Reference

PartMakerMethodToDivideVolumes Class

Autodesk.Revit.DB Namespace